TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/driverlib/inc/hw_sysctl.h
//###########################################################################
//
// FILE:    hw_sysctl.h
//
// TITLE:   Definitions for the SYSCTL registers.
//
//###########################################################################
// 
// C2000Ware v26.01.00.00
//
// Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef HW_SYSCTL_H
#define HW_SYSCTL_H

//*************************************************************************************************
//
// The following are defines for the SYSCTL register offsets
//
//*************************************************************************************************
#define SYSCTL_O_PARTIDL       0x8U     // Lower 32-bit of Device PART Identification Number
#define SYSCTL_O_PARTIDH       0xAU     // Upper 32-bit of Device PART Identification Number
#define SYSCTL_O_REVID         0xCU     // Device Revision Number
#define SYSCTL_O_TRIMERRSTS    0x74U    // TRIM Error Status register
#define SYSCTL_O_SOFTPRES0     0x82U    // Processing Block Software Reset register
#define SYSCTL_O_SOFTPRES2     0x86U    // EPWM Software Reset register
#define SYSCTL_O_SOFTPRES3     0x88U    // ECAP Software Reset register
#define SYSCTL_O_SOFTPRES4     0x8AU    // EQEP Software Reset register
#define SYSCTL_O_SOFTPRES7     0x90U    // SCI Software Reset register
#define SYSCTL_O_SOFTPRES8     0x92U    // SPI Software Reset register
#define SYSCTL_O_SOFTPRES9     0x94U    // I2C Software Reset register
#define SYSCTL_O_SOFTPRES10    0x96U    // CAN Software Reset register
#define SYSCTL_O_SOFTPRES11    0x98U    // McBSP/USB Software Reset register
#define SYSCTL_O_SOFTPRES13    0x9CU    // ADC Software Reset register
#define SYSCTL_O_SOFTPRES14    0x9EU    // CMPSS Software Reset register
#define SYSCTL_O_SOFTPRES15    0xA0U    // PGA Software Reset register
#define SYSCTL_O_SOFTPRES16    0xA2U    // DAC Software Reset register
#define SYSCTL_O_SOFTPRES17    0xA4U    // CLB Software Reset register
#define SYSCTL_O_SOFTPRES18    0xA6U    // FSI Software Reset register
#define SYSCTL_O_SOFTPRES19    0xA8U    // LIN Software Reset register
#define SYSCTL_O_SOFTPRES20    0xAAU    // PMBUS Software Reset register
#define SYSCTL_O_SOFTPRES21    0xACU    // DCC Software Reset register
#define SYSCTL_O_SOFTPRES26    0xB6U    // AES Software Reset register
#define SYSCTL_O_SOFTPRES27    0xB8U    // EPG Software Reset register
#define SYSCTL_O_SOFTPRES28    0xBAU    // Flash Software Reset register
#define SYSCTL_O_SOFTPRES30    0xBEU    // NPU Software reset register
#define SYSCTL_O_SOFTPRES40    0xD2U    // Peripheral Software Reset register
#define SYSCTL_O_TAP_STATUS    0x130U   // Status of JTAG State machine & Debugger Connect
#define SYSCTL_O_TAP_CONTROL   0x132U   // Disable TAP control
#define SYSCTL_O_USBTYPE       0x19AU   // Configures USB Type for the device
#define SYSCTL_O_ECAPTYPE      0x19BU   // Configures ECAP Type for the device
#define SYSCTL_O_MCUCNF3       0x1A6U   // MCU Configuration: ETPWM
#define SYSCTL_O_MCUCNF8       0x1B0U   // MCU Configuration: SCI
#define SYSCTL_O_MCUCNF11      0x1B6U   // MCU Configuration: CAN
#define SYSCTL_O_MCUCNF12      0x1B8U   // MCU Configuration: McBSP_USB
#define SYSCTL_O_MCUCNF14      0x1BCU   // MCU Configuration: ADC
#define SYSCTL_O_MCUCNF16      0x1C0U   // MCU Configuration: PGA
#define SYSCTL_O_MCUCNF18      0x1C4U   // MCU Configuration: Lx.1 SRAM Customization
#define SYSCTL_O_MCUCNF20      0x1C8U   // MCU Configuration: GSx SRAM Customization
#define SYSCTL_O_MCUCNF21      0x1CAU   // MCU Configuration: CLB
#define SYSCTL_O_MCUCNF23      0x1CEU   // MCU Configuration: LIN
#define SYSCTL_O_MCUCNF31      0x1DEU   // MCU Configuration: Flash Bank0
#define SYSCTL_O_MCUCNF32      0x1E0U   // MCU Configuration: Flash Bank1
#define SYSCTL_O_MCUCNF33      0x1E2U   // MCU Configuration: Flash Bank2
#define SYSCTL_O_MCUCNF34      0x1E4U   // MCU Configuration: Flash Bank3
#define SYSCTL_O_MCUCNF35      0x1E6U   // MCU Configuration: Flash Bank4
#define SYSCTL_O_MCUCNFLOCK    0x1F8U   // Lock bit for MCUCNFx registers

#define SYSCTL_O_CLKCFGLOCK1     0x2U    // Lock bit for CLKCFG registers
#define SYSCTL_O_CLKSRCCTL1      0x8U    // Clock Source Control register-1
#define SYSCTL_O_CLKSRCCTL2      0xAU    // Clock Source Control register-2
#define SYSCTL_O_CLKSRCCTL3      0xCU    // Clock Source Control register-3
#define SYSCTL_O_SYSPLLCTL1      0xEU    // SYSPLL Control register-1
#define SYSCTL_O_SYSPLLMULT      0x14U   // SYSPLL Multiplier register
#define SYSCTL_O_SYSPLLSTS       0x16U   // SYSPLL Status register
#define SYSCTL_O_SYSCLKDIVSEL    0x22U   // System Clock Divider Select register
#define SYSCTL_O_AUXCLKDIVSEL    0x24U   // Auxillary Clock Divider Select register
#define SYSCTL_O_PERCLKDIVSEL    0x26U   // Peripheral Clock Divider Select register
#define SYSCTL_O_XCLKOUTDIVSEL   0x28U   // XCLKOUT Divider Select register
#define SYSCTL_O_CLBCLKCTL       0x2AU   // CLB Clocking Control Register
#define SYSCTL_O_LOSPCP          0x2CU   // Low Speed Clock Source Prescalar
#define SYSCTL_O_MCDCR           0x2EU   // Missing Clock Detect Control Register
#define SYSCTL_O_X1CNT           0x30U   // 10-bit Counter on X1 Clock
#define SYSCTL_O_XTALCR          0x32U   // XTAL Control Register
#define SYSCTL_O_XTALCR2         0x3AU   // XTAL Control Register for pad init
#define SYSCTL_O_CLKFAILCFG      0x3CU   // Clock Fail cause Configuration

#define SYSCTL_O_CPUSYSLOCK1          0x0U    // Lock bit for CPUSYS registers
#define SYSCTL_O_CPUSYSLOCK2          0x2U    // Lock bit for CPUSYS registers
#define SYSCTL_O_PIEVERRADDR          0xAU    // PIE Vector Fetch Error Address register
#define SYSCTL_O_PCLKCR0              0x22U   // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR2              0x26U   // Peripheral Clock Gating Register - ETPWM
#define SYSCTL_O_PCLKCR3              0x28U   // Peripheral Clock Gating Register - ECAP
#define SYSCTL_O_PCLKCR4              0x2AU   // Peripheral Clock Gating Register - EQEP
#define SYSCTL_O_PCLKCR7              0x30U   // Peripheral Clock Gating Register - SCI
#define SYSCTL_O_PCLKCR8              0x32U   // Peripheral Clock Gating Register - SPI
#define SYSCTL_O_PCLKCR9              0x34U   // Peripheral Clock Gating Register - I2C
#define SYSCTL_O_PCLKCR10             0x36U   // Peripheral Clock Gating Register - CAN
#define SYSCTL_O_PCLKCR11             0x38U   // Peripheral Clock Gating Register - McBSP_USB
#define SYSCTL_O_PCLKCR12             0x3AU   // Peripheral Clock Gating Register - Upp
#define SYSCTL_O_PCLKCR13             0x3CU   // Peripheral Clock Gating Register - ADC
#define SYSCTL_O_PCLKCR14             0x3EU   // Peripheral Clock Gating Register - CMPSS
#define SYSCTL_O_PCLKCR15             0x40U   // Peripheral Clock Gating Register - PGA
#define SYSCTL_O_PCLKCR16             0x42U   // Peripheral Clock Gating Register Buf_DAC
#define SYSCTL_O_PCLKCR17             0x44U   // Peripheral Clock Gating Register - CLB
#define SYSCTL_O_PCLKCR18             0x46U   // Peripheral Clock Gating Register - FSI
#define SYSCTL_O_PCLKCR19             0x48U   // Peripheral Clock Gating Register - LIN
#define SYSCTL_O_PCLKCR20             0x4AU   // Peripheral Clock Gating Register - PMBUS
#define SYSCTL_O_PCLKCR21             0x4CU   // Peripheral Clock Gating Register - DCC
#define SYSCTL_O_PCLKCR26             0x56U   // Peripheral Clock Gating Register - AES
#define SYSCTL_O_PCLKCR27             0x58U   // Peripheral Clock Gating Register - EPG
#define SYSCTL_O_SIMRESET             0x70U   // Simulated Reset Register
#define SYSCTL_O_LPMCR                0x76U   // LPM Control Register
#define SYSCTL_O_GPIOLPMSEL0          0x78U   // GPIO LPM Wakeup select registers
#define SYSCTL_O_GPIOLPMSEL1          0x7AU   // GPIO LPM Wakeup select registers
#define SYSCTL_O_TMR2CLKCTL           0x7CU   // Timer2 Clock Measurement functionality control
                                              // register
#define SYSCTL_O_RESCCLR              0x7EU   // Reset Cause Clear Register
#define SYSCTL_O_RESC                 0x80U   // Reset Cause register
#define SYSCTL_O_CMPSSLPMSEL          0x84U   // CMPSS LPM Wakeup select registers
#define SYSCTL_O_MCANRAMACC           0x90U   // MCAN RAM access control Register
#define SYSCTL_O_MCANWAKESTATUS       0x98U   // MCAN Wake Status Register
#define SYSCTL_O_MCANWAKESTATUSCLR    0x9AU   // MCAN Wake Status Clear Register
#define SYSCTL_O_CLKSTOPREQ           0x9CU   // Peripheral Clock Stop Request Register
#define SYSCTL_O_CLKSTOPACK           0x9EU   // Peripheral Clock Stop Ackonwledge Register
#define SYSCTL_O_USER_REG1_SYSRSN     0xA0U   // Software Configurable registers reset by SYSRSn
#define SYSCTL_O_USER_REG2_SYSRSN     0xA2U   // Software Configurable registers reset by SYSRSn
#define SYSCTL_O_USER_REG1_XRSN       0xA4U   // Software Configurable registers reset by XRSn
#define SYSCTL_O_USER_REG2_XRSN       0xA6U   // Software Configurable registers reset by XRSn
#define SYSCTL_O_USER_REG1_PORESETN   0xA8U   // Software Configurable registers reset by PORESETn
#define SYSCTL_O_USER_REG2_PORESETN   0xAAU   // Software Configurable registers reset by PORESETn
#define SYSCTL_O_USER_REG3_PORESETN   0xACU   // Software Configurable registers reset by PORESETn
#define SYSCTL_O_USER_REG4_PORESETN   0xAEU   // Software Configurable registers reset by PORESETn

#define SYSCTL_O_SCSR     0x22U   // System Control & Status Register
#define SYSCTL_O_WDCNTR   0x23U   // Watchdog Counter Register
#define SYSCTL_O_WDKEY    0x25U   // Watchdog Reset Key Register
#define SYSCTL_O_WDCR     0x29U   // Watchdog Control Register
#define SYSCTL_O_WDWCR    0x2AU   // Watchdog Windowed Control Register

#define SYSCTL_O_CLA1TASKSRCSELLOCK   0x0U    // CLA1 Task Trigger Source Select Lock Register
#define SYSCTL_O_DMACHSRCSELLOCK      0x4U    // DMA Channel Triger Source Select Lock Register
#define SYSCTL_O_CLA1TASKSRCSEL1      0x6U    // CLA1 Task Trigger Source Select Register-1
#define SYSCTL_O_CLA1TASKSRCSEL2      0x8U    // CLA1 Task Trigger Source Select Register-2
#define SYSCTL_O_DMACHSRCSEL1         0x16U   // DMA Channel Trigger Source Select Register-1
#define SYSCTL_O_DMACHSRCSEL2         0x18U   // DMA Channel Trigger Source Select Register-2

#define SYSCTL_O_ADCA_AC          0x0U     // ADCA Controller Access Control Register
#define SYSCTL_O_ADCB_AC          0x2U     // ADCB Controller Access Control Register
#define SYSCTL_O_ADCC_AC          0x4U     // ADCC Controller Access Control Register
#define SYSCTL_O_ADCD_AC          0x6U     // ADCD Controller Access Control Register
#define SYSCTL_O_ADCE_AC          0x8U     // ADCE Controller Access Control Register
#define SYSCTL_O_CMPSS1_AC        0x10U    // CMPSS1 Controller Access Control Register
#define SYSCTL_O_CMPSS2_AC        0x12U    // CMPSS2 Controller Access Control Register
#define SYSCTL_O_CMPSS3_AC        0x14U    // CMPSS3 Controller Access Control Register
#define SYSCTL_O_CMPSS4_AC        0x16U    // CMPSS4 Controller Access Control Register
#define SYSCTL_O_DACA_AC          0x28U    // DACA Controller Access Control Register
#define SYSCTL_O_PGA1_AC          0x38U    // PGAA Controller Access Control Register
#define SYSCTL_O_PGA2_AC          0x3AU    // PGAB Controller Access Control Register
#define SYSCTL_O_PGA3_AC          0x3CU    // PGAC Controller Access Control Register
#define SYSCTL_O_EPWM1_AC         0x48U    // EPWM1 Controller Access Control Register
#define SYSCTL_O_EPWM2_AC         0x4AU    // EPWM2 Controller Access Control Register
#define SYSCTL_O_EPWM3_AC         0x4CU    // EPWM3 Controller Access Control Register
#define SYSCTL_O_EPWM4_AC         0x4EU    // EPWM4 Controller Access Control Register
#define SYSCTL_O_EPWM5_AC         0x50U    // EPWM5 Controller Access Control Register
#define SYSCTL_O_EPWM6_AC         0x52U    // EPWM6 Controller Access Control Register
#define SYSCTL_O_EPWM7_AC         0x54U    // EPWM7 Controller Access Control Register
#define SYSCTL_O_EPWM8_AC         0x56U    // EPWM8 Controller Access Control Register
#define SYSCTL_O_EPWM9_AC         0x58U    // EPWM9 Controller Access Control Register
#define SYSCTL_O_EPWM10_AC        0x5AU    // EPWM10 Controller Access Control Register
#define SYSCTL_O_EPWM11_AC        0x5CU    // EPWM11 Controller Access Control Register
#define SYSCTL_O_EPWM12_AC        0x5EU    // EPWM12 Controller Access Control Register
#define SYSCTL_O_EQEP1_AC         0x70U    // EQEP1 Controller Access Control Register
#define SYSCTL_O_EQEP2_AC         0x72U    // EQEP2 Controller Access Control Register
#define SYSCTL_O_EQEP3_AC         0x74U    // EQEP3 Controller Access Control Register
#define SYSCTL_O_ECAP1_AC         0x80U    // ECAP1 Controller Access Control Register
#define SYSCTL_O_ECAP2_AC         0x82U    // ECAP2 Controller Access Control Register
#define SYSCTL_O_CLB1_AC          0xB0U    // CLB1 Controller Access Control Register
#define SYSCTL_O_CLB2_AC          0xB2U    // CLB2 Controller Access Control Register
#define SYSCTL_O_SCIA_AC          0x100U   // SCIA Controller Access Control Register
#define SYSCTL_O_SCIB_AC          0x102U   // SCIB Controller Access Control Register
#define SYSCTL_O_SCIC_AC          0x104U   // SCIC Controller Access Control Register
#define SYSCTL_O_SPIA_AC          0x110U   // SPIA Controller Access Control Register
#define SYSCTL_O_SPIB_AC          0x112U   // SPIB Controller Access Control Register
#define SYSCTL_O_I2CA_AC          0x120U   // I2CA Controller Access Control Register
#define SYSCTL_O_I2CB_AC          0x122U   // I2CB Controller Access Control Register
#define SYSCTL_O_PMBUS_A_AC       0x130U   // PMBUSA Controller Access Control Register
#define SYSCTL_O_LIN_A_AC         0x138U   // LINA Controller Access Control Register
#define SYSCTL_O_MCANA_AC         0x148U   // MCANA Controller Access Control Register
#define SYSCTL_O_MCANB_AC         0x14AU   // MCANB Controller Access Control Register
#define SYSCTL_O_FSIATX_AC        0x158U   // FSIA Controller Access Control Register
#define SYSCTL_O_FSIARX_AC        0x15AU   // FSIB Controller Access Control Register
#define SYSCTL_O_USBA_AC          0x182U   // USBA Controller Access Control Register
#define SYSCTL_O_HRPWM_A_AC       0x1AAU   // HRPWM Controller Access Control Register
#define SYSCTL_O_AESA_AC          0x1AEU   // AES Controller Access Control Register
#define SYSCTL_O_PERIPH_AC_LOCK   0x1FEU   // Lock Register to stop Write access to peripheral
                                           // Access register.

